[
{
"title": "All 53,000 attendees of Anime NYC urged to get tested after one got Omicron",
"url": "https://www.theverge.com/22814974/anime-nyc-omicron-case-coronavirus-covid-19-superspreader",
"content": "Were you one of the 53,000 attendees of the Anime NYC 2021 convention in New York City, or know someone who did? New York City authorities and Anime NYC organizers are urging them to get tested for Omicron."
},
{
"title": "Tim Pool Got Covid-19 After Railing Against Vaccine Mandates",
"url": "https://gizmodo.com/tim-pool-got-covid-19-after-railing-against-vaccine-man-1847998033",
"content": "Right-wing YouTuber Tim Pool, who has been one of the more prominent online voices pushing culture-war tirades about the covid-19 pandemic, recently contracted the coronavirus after refusing to get vaccinated and after hosting an indoor event for fans with fe…"
},
{
"title": "Covid-19 Boosters for All Are On the Way",
"url": "https://gizmodo.com/covid-19-boosters-for-all-are-on-the-way-1848085296",
"content": "Federal health officials are expected to sanction covid-19 boosters for most Americans this week—a decision that’s become well-supported by the science. While the original shots still provide plenty of protection, booster doses are clearly restoring or even s…"
},
{
"title": "Emerging Omicron Coronavirus Variant Has Officials Worldwide on the Defensive",
"url": "https://gizmodo.com/emerging-omicron-coronavirus-variant-has-officials-worl-1848127516",
"content": "Authorities worldwide have started taking steps to contain the spread of the new coronavirus variant Omicron as the holiday season enters full swing. On Friday, the World Health Organization recognized the heavily mutated coronavirus variant, which was first …"
},
{
"title": "NFL Adds Mask Requirement, Increases Covid Testing",
"url": "https://www.nytimes.com/2021/11/17/sports/football/nfl-covid-testing-masks-thanksgiving.html",
"content": "After N.F.L. cases more than doubled, the league strengthened its Covid-19 protocols and recommended teams help set up testing for families of players and team staff ahead of the holiday."
},
{
"title": "Appeals Court Upholds Block on Biden’s Vaccine Mandate for Employers",
"url": "https://www.nytimes.com/live/2021/11/13/world/covid-vaccine-boosters-mandate",
"content": "A federal court declared that the rule “grossly exceeds” the authority of the occupational safety agency that issued it. Here’s the latest on Covid-19."
},
{
"title": "Singapore to End Free Covid Care for Those ‘Unvaccinated by Choice’",
"url": "https://www.nytimes.com/live/2021/11/09/world/us-travel-restrictions-ban-covid-19",
"content": "Charging Covid patients who had the option to be inoculated will “send this important signal,” the country’s health minister said. Officials at a Vermont college blame Halloween parties for a coronavirus outbreak."
},
{
"title": "Florida Curtails Coronavirus Mandates, Reflecting Wishes of Vaccine Skeptics",
"url": "https://www.nytimes.com/2021/11/17/us/florida-coronavirus-covid-19.html",
"content": "Florida lawmakers, at the request of Gov. Ron DeSantis, passed new laws sharply curtailing mask and vaccine mandates. Fringe anti-vaccination views met with little pushback."
},
{
"title": "Military Grants Few Vaccine Exemptions as Deadlines Loom",
"url": "https://www.nytimes.com/2021/11/02/us/politics/vaccine-mandate-military.html",
"content": "The majority of active-duty troops have gotten a mandatory coronavirus vaccine ahead of deadline, with religious-based exemptions largely dismissed."
},
{
"title": "Covid-19 Boosters for All Are On the Way",
"url": "https://gizmodo.com/covid-19-boosters-for-all-are-on-the-way-1848085296",
"content": "Federal health officials are expected to sanction covid-19 boosters for most Americans this week—a decision that’s become well-supported by the science. While the original shots still provide plenty of protection, booster doses are clearly restoring or even s…"
},
{
"title": "Emerging Omicron Coronavirus Variant Has Officials Worldwide on the Defensive",
"url": "https://gizmodo.com/emerging-omicron-coronavirus-variant-has-officials-worl-1848127516",
"content": "Authorities worldwide have started taking steps to contain the spread of the new coronavirus variant Omicron as the holiday season enters full swing. On Friday, the World Health Organization recognized the heavily mutated coronavirus variant, which was first …"
},
{
"title": "CV brfg hed TK",
"url": "https://www.nytimes.com/live/2021/11/03/world/covid-delta-variant-vaccine",
"content": "Many medical facilities in the state are at 90 percent capacity, with intensive care units overflowing. Most of the people needing admission are unvaccinated."
},
{
"title": "Fire in Covid intensive care ward kills 11 people in India.",
"url": "https://www.nytimes.com/live/2021/11/06/world/covid-booster-vaccine",
"content": "Staff at the hospital in the western state of Maharashtra tried to douse the fire with fire extinguishers, but the flames spread quickly in the airtight room."
}
]