[
{
"title": "All 53,000 attendees of Anime NYC urged to get tested after one got Omicron",
"url": "https://www.theverge.com/22814974/anime-nyc-omicron-case-coronavirus-covid-19-superspreader",
"content": "Were you one of the 53,000 attendees of the Anime NYC 2021 convention in New York City, or know someone who did? New York City authorities and Anime NYC organizers are urging them to get tested for Omicron. <a href=\"https://www.theverge.com/22814974/anime-nyc-omicron-case-coronavirus-covid-19-superspreader\">Click for full article...</a>"
},
{
"title": "Covid-19 Boosters for All Are On the Way",
"url": "https://gizmodo.com/covid-19-boosters-for-all-are-on-the-way-1848085296",
"content": "Federal health officials are expected to sanction covid-19 boosters for most Americans this week—a decision that’s become well-supported by the science. While the original shots still provide plenty of protection, booster doses are clearly restoring or even s… <a href=\"https://gizmodo.com/covid-19-boosters-for-all-are-on-the-way-1848085296\">Click for full article...</a>"
},
{
"title": "Emerging Omicron Coronavirus Variant Has Officials Worldwide on the Defensive",
"url": "https://gizmodo.com/emerging-omicron-coronavirus-variant-has-officials-worl-1848127516",
"content": "Authorities worldwide have started taking steps to contain the spread of the new coronavirus variant Omicron as the holiday season enters full swing. On Friday, the World Health Organization recognized the heavily mutated coronavirus variant, which was first … <a href=\"https://gizmodo.com/emerging-omicron-coronavirus-variant-has-officials-worl-1848127516\">Click for full article...</a>"
},
{
"title": "NFL Adds Mask Requirement, Increases Covid Testing",
"url": "https://www.nytimes.com/2021/11/17/sports/football/nfl-covid-testing-masks-thanksgiving.html",
"content": "After N.F.L. cases more than doubled, the league strengthened its Covid-19 protocols and recommended teams help set up testing for families of players and team staff ahead of the holiday. <a href=\"https://www.nytimes.com/2021/11/17/sports/football/nfl-covid-testing-masks-thanksgiving.html\">Click for full article...</a>"
},
{
"title": "Appeals Court Upholds Block on Biden’s Vaccine Mandate for Employers",
"url": "https://www.nytimes.com/live/2021/11/13/world/covid-vaccine-boosters-mandate",
"content": "A federal court declared that the rule “grossly exceeds” the authority of the occupational safety agency that issued it. Here’s the latest on Covid-19. <a href=\"https://www.nytimes.com/live/2021/11/13/world/covid-vaccine-boosters-mandate\">Click for full article...</a>"
},
{
"title": "Singapore to End Free Covid Care for Those ‘Unvaccinated by Choice’",
"url": "https://www.nytimes.com/live/2021/11/09/world/us-travel-restrictions-ban-covid-19",
"content": "Charging Covid patients who had the option to be inoculated will “send this important signal,” the country’s health minister said. Officials at a Vermont college blame Halloween parties for a coronavirus outbreak. <a href=\"https://www.nytimes.com/live/2021/11/09/world/us-travel-restrictions-ban-covid-19\">Click for full article...</a>"
},
{
"title": "Three Snow Leopards Died of Covid Complications at Nebraska Zoo",
"url": "https://www.nytimes.com/2021/11/13/us/snow-leopards-covid-nebraska-zoo.html",
"content": "The mountain cats had tested positive for the virus about a month ago. <a href=\"https://www.nytimes.com/2021/11/13/us/snow-leopards-covid-nebraska-zoo.html\">Click for full article...</a>"
}
]